In [2]:
import pandas as pd
import numpy as np

In [3]:
arr = np.array([4,3,-1,2,5])
np.var(arr)

4.24

In [4]:
np.std(arr)

2.0591260281974

In [9]:
range_arr = arr.max() - arr.min()
print(range_arr)

6

In [10]:
iqr = np.percentile(arr, 75) - np.percentile(arr, 25)
print(iqr)

2.0

## Reading the dataset

In [12]:
df = pd.read_csv("../data/titanic_train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
df['Age'].var()

211.01912474630802

In [14]:
df['Age'].std()

14.526497332334042

In [15]:
df['Age'].max()

80.0

In [16]:
df['Age'].min()

0.42

In [19]:
df['Age'].quantile(.75) - df['Age'].quantile(.25)

17.875